app/Controllers/itemsController.php

    public function additem()
    {
        $session = session();
        if (!$session->get('ID')) {
            return redirect()->to(base_url("/login"));
        }
        $businessID = session()->get('businessID');
        $itemsModel = new itemsModel();
        $lastCode = $itemsModel->select('Code')->where('idBusiness', $businessID)->orderBy('Code', 'DESC')->limit(1)->first();
        $newCode = $lastCode ? intval($lastCode['Code']) + 1 : 1;

        $servicesModel = new ServicesModel();
        $data = [
            'units' => $servicesModel->getUnits(),
            'categories' => $servicesModel->getCategories(),
            'tax' => $servicesModel->getTaxes(),
            'newCode' => $newCode,
        ];
        $Model = new itemsModel();
        $data['warehouse'] = $Model->getIdWarehouse();

        $configModel = new ConfigModel();
        $businessID = session()->get('businessID');
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1

    public function items_table()
    {
        $session = session();
        if (!$session->get('ID')) {
            return redirect()->to(base_url("/login"));
        }

        $servicesModel = new ServicesModel();
        $data = [
            'units' => $servicesModel->getUnits(),
            'categories' => $servicesModel->getCategories(),
            'tax' => $servicesModel->getTaxes(),
        ];
        $Model = new itemsModel();
        $data['warehouse'] = $Model->getIdWarehouse();
        $configModel = new ConfigModel();
        $businessID = session()->get('businessID');
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1