app/Controllers/LoginController.php

    public function dashboard()
    {
        $session = session();
        if (!$session->get('ID')) {
            return redirect()->to(base_url("/session_expired"));
        }
        $businessID = session()->get('businessID');



        $businessModel = new LoginModel('business');
        $business = $businessModel->find($businessID);
        $businessTypeID = $business['businessTypeID'];

        $businessTypeModel = new LoginModel('businesstype');
        $businessType = $businessTypeModel->find($businessTypeID);
        $isHospital = strtolower($businessType['businessType']) === 'hospital';
        $data['isHospital'] = $isHospital;

        $itemModel = new itemsModel();
        $data['expiringItems'] = $itemModel->getExpiringItems($businessID);

        $configModel = new ConfigModel();
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `business`
WHERE `business`.`ID` = '39'
SELECT *
FROM `businesstype`
WHERE `businesstype`.`ID` = '1'
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1