app/Controllers/newSalesController.php

    public function __construct()
    {
        $this->db = \Config\Database::connect();

        $configModel = new ConfigModel();
        $businessID = session()->get('businessID');
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1

    public function New_SalesFrom()
    {
        $data['baseURL'] = base_url();

        $clientModel = new ClientModel();
        $data['client_names'] = $clientModel->getClientNames();

        $sales = new salesModel();
        $data['payments'] = $sales->getpayment();
        $data['currencies'] = $sales->getCurrancy();

        $configModel = new ConfigModel();
        $businessID = session()->get('businessID');
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1