app/Controllers/SalesController.php

    public function sales_form()
    {
        $session = session();
        if (!$session->get('ID')) {
            return redirect()->to(base_url("/session_expired"));
        }
        $clientModel = new ClientModel();
        $data['client_names'] = $clientModel->getClientNames();
        $sales = new salesModel();
        $data['payments'] = $sales->getpayment();
        $data['currencies'] = $sales->getCurrancy();
        $data['services'] = $sales->getServices();
        $data['categories'] = $sales->getCategories();
        $data['salesModel'] = $sales;

        $configModel = new ConfigModel();
        $businessID = session()->get('businessID');
        $config = $configModel->where('businessID', $businessID)->first();
---
SELECT *
FROM `config`
WHERE `businessID` = '39'
 LIMIT 1

    public function viewServiceDetails($idReceipts)
    {
        $model = new salesModel();
        $clientModel = new ClientModel();

        $data['payments'] = $model->getpayment();
        $data['currencies'] = $model->getCurrancy();

        $data['ServiceDetails'] = $model->getSalesDetails($idReceipts);
        $data['PaymentDetails'] = $model->getPaymentDetails($idReceipts);
        $data['clients'] = $clientModel->findAll();
---
SELECT *
FROM `client`

                    'idSummaryInvoice' => 0,
                    'Discount' => $discount,
                ];
                $invoiceDetailModel->insert($serviceData);
---
INSERT INTO `invoicedetail` (`idReceipts`, `Nr`, `idArtMenu`, `Quantity`, `Price`, `Sum`, `idBusiness`, `IdTax`, `ValueTax`, `idMag`, `name`, `idSummaryInvoice`, `Discount`) VALUES (62, 0, '11', 1, '3', 3, '39', 1, 0, 1, 'Service 2', 0, 0)