app/Controllers/SalesController.php

    public function submitServices()
    {
        $db = \Config\Database::connect();
        try {
            $invoice = new InvoiceModel();
            $invoiceDetailModel = new InvoiceDetailModel();
            $clientId = $this->request->getPost('clientId');
            $clientName = $this->request->getPost('clientName');
            $exchange = $this->request->getPost('exchange');
            $currency = $this->request->getPost('currency');
            $currencyName = $this->request->getPost('currencyName');
            $paymentMethod = $this->request->getPost('paymentMethodName');
            $paymentMethodName = $this->request->getPost('paymentName');
            $paymentMethodID = $this->request->getPost('paymentMethodId');
            $totalFee = $this->request->getPost('totalFee');
            $services = $this->request->getPost('services');
            $session = \Config\Services::session();
            $businessID = $session->get('businessID');
            $UserID = $session->get('ID');
            $db->transBegin();
            if (!is_null($services)) {
                $totalFee = 0;
                foreach ($services as $service) {
                    $totalFee += $service['fee'];
                }
            } else {
                throw new \Exception('Services data is null.');
            }
            $lastInvoiceNumber = $invoice->select('invOrdNum')->orderBy('invOrdNum', 'DESC')->limit(1)->first();
---
SELECT `invOrdNum`
FROM `invoices`
ORDER BY `invOrdNum` DESC
 LIMIT 1

                    'idSummaryInvoice' => 0,
                    'Discount' => $service['discount'],
                ];
                $invoiceDetailModel->insert($serviceData);

                // Get the ratio and idItem from the ratio table based on idArtMenu
                $ratioBuilder = $db->table('ratio');
                $ratioData = $ratioBuilder->where('idArtMenu', $service['serviceTypeId'])
                    ->where('idBusiness', $businessID)
                    ->get()
                    ->getRowArray();
---
INSERT INTO `invoicedetail` (`idReceipts`, `Nr`, `idArtMenu`, `Quantity`, `Price`, `Sum`, `idBusiness`, `IdTax`, `ValueTax`, `idMag`, `name`, `idSummaryInvoice`, `Discount`) VALUES (204, 0, '160', '1', '20', 20, '39', 1, 0, 1, 'Item', 0, '0')
SELECT *
FROM `ratio`
WHERE `idArtMenu` = '160'
AND `idBusiness` = '39'


                        // Get the current value of the Unit column
                        $itemsWarehouseBuilder = $db->table('itemswarehouse');
                        $currentUnit = $itemsWarehouseBuilder->select('Unit')
                            ->where('idItem', $idItem)
                            ->where('idBusiness', $businessID)
                            ->get()
                            ->getRowArray()['Unit'];
---
SELECT `Unit`
FROM `itemswarehouse`
WHERE `idItem` = '25'
AND `idBusiness` = '39'

                        $newUnit = max(0, $newUnit);

                        // Update the itemswarehouse table with the new Unit value
                        $itemsWarehouseBuilder->where('idItem', $idItem)
                            ->where('idBusiness', $businessID)
                            ->set('Unit', $newUnit)
                            ->update();
---
UPDATE `itemswarehouse` SET `ratio` = '1', `Unit` = 3
WHERE `idItem` = '25'
AND `idBusiness` = '39'