app/Models/AppointmentModel.php

SELECT COUNT(*) AS `numrows`
FROM `appointment`
WHERE `businessID` = '39'
---
    public function getTotalAppointmentsRevenue($businessID)
    {
        $query = $this->selectSum('appointmentFee', 'totalAppointmentsRevenue')
            ->where('businessID', $businessID)
            ->get();

        return $query->getRow()->totalAppointmentsRevenue;

SELECT `appointment`.`appointmentDate`, (SELECT SUM(appointmentFee) FROM appointment a 
                        WHERE a.appointmentDate = appointment.appointmentDate) as totalRevenue, COUNT(appointment.appointmentID) as totalAppointments
FROM `appointment`
WHERE `appointment`.`businessID` = '39'
AND `appointment`.`appointmentDate` >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)
GROUP BY `appointment`.`appointmentDate`
---
    public function getRecentAppointmentsByBusinessID($businessID, $limit = 6)
    {

        $query = $this->db->table('appointment')
            ->join('client', 'appointment.clientID = client.idClient')
            ->where('appointment.businessID', $businessID)
            ->orderBy('appointment.appointmentDate', 'desc')
            ->limit($limit)
            ->select('appointment.*, client.client as clientName');


        $result = $query->get()->getResult();

SELECT COUNT(*) AS `numrows` FROM `appointment`
---
    public function getTotalChargesRevenue($businessID)
    {
        $query = $this->selectSum('hospitalCharges', 'totalChargesRevenue')
            ->where('businessID', $businessID)
            ->get();

        return $query->getRow()->totalChargesRevenue;