app/Models/AppointmentModel.php

    public function getTotalHospitalCharges($doctor = null, $client = null, $fromDate = null, $toDate = null)
    {
        $builder = $this->db->table('appointment');
        $builder->selectSum('hospitalCharges', 'totalHospitalCharges');
        $builder->join('doctorprofile', 'doctorprofile.DoctorID = appointment.doctorID');
        $builder->join('client', 'client.idClient = appointment.clientID');

        if (!empty($doctor)) {
            $builder->groupStart()
                ->like('CONCAT_WS(" ", doctorprofile.FirstName, doctorprofile.LastName)', $doctor)
                ->groupEnd();
        }


        if (!empty($client)) {
            $builder->like('client.client', $client);
        }


        if (!empty($fromDate) && !empty($toDate)) {
            $builder->where('appointment.appointmentDate >=', $fromDate)
                ->where('appointment.appointmentDate <=', $toDate);
        }

        $query = $builder->get();
---
SELECT SUM(`hospitalCharges`) AS `totalHospitalCharges`
FROM `appointment`
JOIN `doctorprofile` ON `doctorprofile`.`DoctorID` = `appointment`.`doctorID`
JOIN `client` ON `client`.`idClient` = `appointment`.`clientID`
WHERE   (
CONCAT_WS(" ", doctorprofile.FirstName, doctorprofile.LastName) LIKE '%Ibrahim Ali%' ESCAPE '!'
 )

    public function getTotalFeeByDoctor($doctor, $client, $fromDate, $toDate)
    {
        $builder = $this->db->table('appointment');
        $builder->selectSum('appointmentFee', 'totalAppointmentFee');
        $builder->join('doctorprofile', 'doctorprofile.DoctorID = appointment.doctorID');
        $builder->join('client', 'client.idClient = appointment.clientID');

        if (!empty($doctor)) {
            $builder->like('CONCAT(doctorprofile.FirstName, " ", doctorprofile.LastName)', $doctor);
        }

        if (!empty($client)) {
            $builder->like('client.client', $client);
        }

        if (!empty($fromDate) && !empty($toDate)) {
            $builder->where('appointment.appointmentDate >=', $fromDate)
                ->where('appointment.appointmentDate <=', $toDate);
        }

        $query = $builder->get();
---
SELECT SUM(`appointmentFee`) AS `totalAppointmentFee`
FROM `appointment`
JOIN `doctorprofile` ON `doctorprofile`.`DoctorID` = `appointment`.`doctorID`
JOIN `client` ON `client`.`idClient` = `appointment`.`clientID`
WHERE CONCAT(doctorprofile.FirstName, " ", doctorprofile.LastName) LIKE '%Ibrahim Ali%' ESCAPE '!'

    public function getTotalFeeByClient($client, $fromDate, $toDate)
    {
        $builder = $this->db->table('appointment');
        $builder->selectSum('(appointment.appointmentFee + appointment.hospitalCharges)', 'totalFee');
        $builder->join('client', 'client.idClient = appointment.clientID');

        if (!empty($client)) {
            $builder->like('client.client', $client);
        }

        if (!empty($fromDate) && !empty($toDate)) {
            $builder->where('appointment.appointmentDate >=', $fromDate)
                ->where('appointment.appointmentDate <=', $toDate);
        }

        $query = $builder->get();
---
SELECT SUM((appointment.appointmentFee + appointment.hospitalCharges)) AS `totalFee`
FROM `appointment`
JOIN `client` ON `client`.`idClient` = `appointment`.`clientID`

    public function getTotalFeeByDateRange($fromDate, $toDate)
    {
        $builder = $this->db->table('appointment');
        $builder->selectSum('(appointment.appointmentFee + appointment.hospitalCharges)', 'totalFee');

        if (!empty($fromDate) && !empty($toDate)) {
            $builder->where('appointment.appointmentDate >=', $fromDate)
                ->where('appointment.appointmentDate <=', $toDate);
        }

        $query = $builder->get();
---
SELECT SUM((appointment.appointmentFee + appointment.hospitalCharges)) AS `totalFee`
FROM `appointment`

    public function getTotalAppointmentFee()
    {
        $businessId = session()->get('businessID');
        $builder = $this->db->table($this->table);
        $builder->selectSum('appointmentFee');
        $builder->where('businessID', $businessId);
        $result = $builder->get()->getRowArray();
---
SELECT SUM(`appointmentFee`) AS `appointmentFee`
FROM `appointment`
WHERE `businessID` = '39'

    public function getAppointmentsForClient($clientId)
    {
        return $this->where('clientID', $clientId)->findAll();
---
SELECT *
FROM `appointment`
WHERE `clientID` = '1'

    public function getTotalAppointmentsRevenue($businessID)
    {
        $query = $this->select('SUM(appointmentFee + hospitalCharges) AS totalAppointmentsRevenue')
            ->where('businessID', $businessID)
            ->get();
---
SELECT SUM(`appointmentFee`) AS `totalAppointmentsRevenue`
FROM `appointment`
WHERE `businessID` = '39'

    public function getMonthlyAppointmentsRevenue($businessID)
    {
        $query = $this->select('SUM(appointmentFee + hospitalCharges) AS totalAppointmentsRevenue')
            ->where('MONTH(appointmentDate)', date('m'))
            ->where('YEAR(appointmentDate)', date('Y'))
            ->where('businessID', $businessID)
            ->get();

        return $query->getRow()->totalAppointmentsRevenue;
---
SELECT `appointment`.`appointmentDate`, (SELECT SUM(appointmentFee) FROM appointment a 
                        WHERE a.appointmentDate = appointment.appointmentDate) as totalRevenue, COUNT(appointment.appointmentID) as totalAppointments
FROM `appointment`
WHERE `appointment`.`businessID` = '39'
AND `appointment`.`appointmentDate` >= DATE_SUB(CURDATE(), INTERVAL 7 DAY)
GROUP BY `appointment`.`appointmentDate`

    public function countTotalAppointments()
    {
        return $this->db->table('appointment')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `appointment`

    public function getRecentAppointmentsByBusinessID($businessID, $limit = 6)
    {

        $query = $this->db->table('appointment')
            ->join('client', 'appointment.clientID = client.idClient')
            ->where('appointment.businessID', $businessID)
            ->orderBy('appointment.appointmentDate', 'desc')
            ->limit($limit)
            ->select('appointment.*, client.client as clientName');
---
SELECT `appointment`.*, `client`.`client` as `clientName`
FROM `appointment`
JOIN `client` ON `appointment`.`clientID` = `client`.`idClient`
WHERE `appointment`.`businessID` = '39'
ORDER BY `appointment`.`appointmentDate` DESC
 LIMIT 6

    public function getTotalChargesRevenue($businessID)
    {
        $query = $this->selectSum('hospitalCharges', 'totalChargesRevenue')
            ->where('businessID', $businessID)
            ->get();
---
SELECT SUM(`hospitalCharges`) AS `totalChargesRevenue`
FROM `appointment`
WHERE `businessID` = '39'