app/Models/ClientModel.php

SELECT `idClient`, `client`, `clientUniqueId`, `contact`
FROM `client`
WHERE `status` = 'Active'
AND `idBusiness` = '39'
---
    public function getClientNames()
    {
        $businessId = session()->get('businessID');
        return $this->select('idClient, client, clientUniqueId, contact')->where('status', 'Active')->where('idBusiness', $businessId)->findAll();

SELECT COUNT(*) AS `numrows`
FROM `client`
WHERE `idBusiness` = '39'
---
    public function countClientsByBusinessID($businessID)
    {
        return $this->db->table('client')->where('idBusiness', $businessID)->countAllResults();

SELECT `age`
FROM `client`
WHERE `idBusiness` = '39'
AND `idClient` = '1'
---
    public function getclientAge($businessID, $clientID)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idClient', $clientID)
            ->select('age')
            ->get()
            ->getRowArray()['age'] ?? null;

SELECT `clientUniqueId`
FROM `client`
WHERE `idBusiness` = '39'
AND `idClient` = '1'
---
    public function getclientUnique($businessID, $clientID)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idClient', $clientID)
            ->select('clientUniqueId')
            ->get()
            ->getRowArray()['clientUniqueId'] ?? null;

SELECT `client`
FROM `client`
WHERE `idBusiness` = '39'
AND `idClient` = '1'
---
    public function getclientName($businessID, $clientID)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idClient', $clientID)
            ->select('client')
            ->get()
            ->getRowArray()['client'] ?? null;

SELECT `gender`
FROM `client`
WHERE `idBusiness` = '39'
AND `idClient` = '1'
---
    public function getclientGender($businessID, $clientID)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idClient', $clientID)
            ->select('gender')
            ->get()
            ->getRowArray()['gender'] ?? null;