app/Models/ClientModel.php

SELECT `idClient`, `client`
FROM `client`
---
    public function getClientNames()
    {
        return $this->select('idClient, client')->findAll();