app/Models/DoctorModel.php

SELECT `doctorprofile`.*, `specialization`.`specialization_N`, COUNT(appointment.appointmentID) as totalAppointments
FROM `doctorprofile`
JOIN `specialization` ON `specialization`.`s_id` = `doctorprofile`.`Specialization`
LEFT JOIN `appointment` ON `appointment`.`doctorID` = `doctorprofile`.`DoctorID`
WHERE `doctorprofile`.`BusinessID` = '39'
GROUP BY `doctorprofile`.`DoctorID`
ORDER BY `doctorprofile`.`DoctorID` DESC
 LIMIT 5
---
    public function getDoctorByBusinessID($businessID)
    {
        return $this->db->table('doctorprofile')
            ->join('specialization', 'specialization.s_id = doctorprofile.Specialization')
            ->join('appointment', 'appointment.doctorID = doctorprofile.DoctorID', 'left')
            ->where('doctorprofile.BusinessID', $businessID)
            ->select('doctorprofile.*, specialization.specialization_N, COUNT(appointment.appointmentID) as totalAppointments')
            ->groupBy('doctorprofile.DoctorID')
            ->orderBy('doctorprofile.DoctorID', 'desc')
            ->limit(5)
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `doctorprofile`
WHERE `BusinessID` = '39'
---
    public function countDoctorsByBusinessID($businessID)
    {
        return $this->db->table('doctorprofile')->where('BusinessID', $businessID)->countAllResults();

SELECT *
FROM `doctor_fee`
WHERE `doctorId` = '1'
AND `FeeTypeId` = '2'
---
    public function getDoctorFee($doctorID, $feeTypeID)
    {
        return $this->db->table('doctor_fee')
            ->where('doctorId', $doctorID)
            ->where('FeeTypeId', $feeTypeID)
            ->get()
            ->getRowArray();