app/Models/ExpenseModel.php

    public function getExpenseCategories()
    {
        return $this->db->table('expense_categories')
            ->select('id, title')
            ->get()
            ->getResultArray();
---
SELECT `id`, `title`
FROM `expense_categories`

    public function getExpenseProject()
    {
        return $this->db->table('expenses')
            ->select('id, project_id')
            ->get()
            ->getResultArray();
---
SELECT `id`, `project_id`
FROM `expenses`

    public function getUsers()
    {
        $session = \Config\Services::session();
        $businessID = $session->get('businessID');
        return $this->db->table('users')
            ->select('ID, fName')
            ->where('businessID', $businessID)
            ->get()
            ->getResultArray();
---
SELECT `ID`, `fName`
FROM `users`
WHERE `businessID` = '39'