app/Models/InvoiceModel.php

    public function insertInvoice($data)
    {
        return $this->insert($data);
---
INSERT INTO `invoices` (`idClient`, `Value`, `idTable`, `idUser`, `Status`, `serial_number`, `idBusiness`, `idCancellation`, `invOrdNum`, `selfissue`, `FIC`, `ValueTVSH`, `idCurrency`, `rate`, `paymentMethod`, `closeShift`, `isSummaryInvoice`, `seial_nr`, `idPoint_of_sale`, `imported_invoice_number`, `isExport`, `isReverseCharge`, `Contract`, `deliveryid`, `invoice_period_start_date`, `invoice_period_end_date`, `filename`, `dokumenti`, `lloji_fatures_id`, `InvoiceNotes`) VALUES ('24', 20, 0, '19', 'closed', 0, '39', 0, 32, 0, 0, 0, '1', '1.0', '1', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)

    public function getinvoiceNumber($businessID, $idPayment)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idReceipts', $idPayment)
            ->select('invOrdNum')
            ->get()
            ->getRowArray()['invOrdNum'] ?? null;
---
SELECT `invOrdNum`
FROM `invoices`
WHERE `idBusiness` = '39'
AND `idReceipts` = 204

    public function getInvoiceById($idReceipts)
    {
        $session = \Config\Services::session();
        $businessID = $session->get('businessID');

        $invoice = $this->db->table('invoices')
            ->where('idReceipts', $idReceipts)
            ->where('idBusiness', $businessID)
            ->get()
            ->getRow();

        if ($invoice) {
            $payments = $this->db->table('invoicepaymentdetails')
                ->selectSum('invoicepaymentdetails.value', 'totalPaid')
                ->join('invoicepayment', 'invoicepayment.idPayment = invoicepaymentdetails.idPayment')
                ->where('invoicepayment.idReceipt', $invoice->idReceipts)
                ->get()
                ->getRow();
---
SELECT *
FROM `invoices`
WHERE `idReceipts` = '447'
AND `idBusiness` = '39'
SELECT SUM(`invoicepaymentdetails`.`value`) AS `totalPaid`
FROM `invoicepaymentdetails`
JOIN `invoicepayment` ON `invoicepayment`.`idPayment` = `invoicepaymentdetails`.`idPayment`
WHERE `invoicepayment`.`idReceipt` = '447'