app/Models/InvoiceModel.php

SELECT `invOrdNum`
FROM `invoices`
WHERE `idBusiness` = '39'
AND `idReceipts` = 657
---
    public function getinvoiceNumber($businessID, $idPayment)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idReceipts', $idPayment)
            ->select('invOrdNum')
            ->get()
            ->getRowArray()['invOrdNum'] ?? null;

SELECT DATE_FORMAT(Date, '%Y-%m-%d') as label, SUM(Value) as total
FROM `invoices`
WHERE `idBusiness` = '39'
AND WEEKDAY(Date) >= 0
AND WEEKDAY(Date) <= 6
AND YEARWEEK(Date, 1) = YEARWEEK(CURDATE(), 1)
GROUP BY `label`
ORDER BY `Date`
---
    public function getWeeklySalesData($businessID)
    {
        return $this->select("DATE_FORMAT(Date, '%Y-%m-%d') as label, SUM(Value) as total")
            ->where('idBusiness', $businessID)
            ->where('WEEKDAY(Date) >=', 0)
            ->where('WEEKDAY(Date) <=', 6)
            ->where('YEARWEEK(Date, 1) = YEARWEEK(CURDATE(), 1)')
            ->groupBy('label')
            ->orderBy('Date')
            ->findAll();