app/Models/InvoiceDetailsModel.php

INSERT INTO `invoicepayment` (`idReceipt`, `idPayment`) VALUES (657, 498)
---
    public function insertInvoicePayment($InvoicePayment)
    {
        $this->db->table('invoicepayment')
            ->insert($InvoicePayment);