app/Models/itemsModel.php

SELECT `idWarehouse`, `name`
FROM `warehouse`
---
    public function getIdWarehouse()
    {
        return $this->db->table('warehouse')
            ->select('idWarehouse, name')
            ->get()
            ->getResultArray();