app/Models/ItemsInventoryModel.php

    public function getRatio($idArtMenu, $idBusiness)
    {
        return $this->db->table('ratio')
            ->select('idItem, ratio')
            ->where('idArtMenu', $idArtMenu)
            ->where('idBusiness', $idBusiness)
            ->get()
            ->getResult();
---
SELECT `idItem`, `ratio`
FROM `ratio`
WHERE `idArtMenu` = '837'
AND `idBusiness` = '39'