app/Models/ItemsInventoryModel.php

SELECT *
FROM `itemsinventory`
WHERE `idItem` = '2414'
AND `idWarehouse` = '1'
 LIMIT 1
UPDATE `itemsinventory` SET `idItem` = '2414', `inventory` = '200', `idWarehouse` = '1'
WHERE `itemsinventory`.`idInventory` IN ('2437')
---
    public function changeInventory($idItem, $data)
    {
        $existingInventory = $this->where('idItem', $idItem)
            ->where('idWarehouse', $data['idWarehouse'])
            ->first();

        if ($existingInventory) {
            $this->update($existingInventory['idInventory'], $data);

UPDATE `itemsinventory` SET `inventory` = inventory - 1
WHERE `idItem` = '6561'
SELECT `idInventory`
FROM `itemsinventory`
WHERE `idItem` = '6561'
UPDATE `itemsexpiry` SET `inventory` = inventory - 1
WHERE `idInventory` = '6580'
AND `expiryDate` = ''
---
    public function subtractFromInventory($idArtMenu, $quantity, $businessID, $expiryDate)
    {
        $idItems = $this->getRatioData($idArtMenu, $businessID);
        $ratio = 1;

        foreach ($idItems as $idItem) {
            $inventorySubtract = $quantity * $ratio;

            log_message('debug', 'Updating inventory for item: ' . $idItem . ' with quantity: ' . $inventorySubtract);
            $this->db->table('itemsinventory')
                ->where('idItem', $idItem)
                ->set('inventory', 'inventory - ' . $inventorySubtract, FALSE)
                ->update();

            if ($this->isExpiryEnabled($businessID)) {

                $query = $this->db->table('itemsinventory')
                    ->select('idInventory')
                    ->where('idItem', $idItem)
                    ->get();

                if ($query->getNumRows() > 0) {
                    $idInventory = $query->getRow()->idInventory;


                    $this->db->table('itemsexpiry')
                        ->where('idInventory', $idInventory)
                        ->where('expiryDate', $expiryDate)
                        ->set('inventory', 'inventory - ' . $inventorySubtract, FALSE)
                        ->update();

SELECT `isExpiry`
FROM `config`
WHERE `businessID` = '39'
---
    public function isExpiryEnabled($businessID)
    {
        $query = $this->db->table('config')
            ->select('isExpiry')
            ->where('businessID', $businessID)
            ->get();

SELECT `idItem`
FROM `ratio`
WHERE `idArtMenu` = '1514'
AND `idBusiness` = '39'
---
    public function getRatioData($idArtMenu, $idBusiness)
    {
        $query = $this->db->table('ratio')
            ->select('idItem')
            ->where('idArtMenu', $idArtMenu)
            ->where('idBusiness', $idBusiness)
            ->get();

SELECT SUM(`itemsinventory`.`inventory`) AS `totalInventory`
FROM `itemsinventory`
JOIN `itemswarehouse` ON `itemsinventory`.`idItem` = `itemswarehouse`.`idItem`
WHERE `itemswarehouse`.`idBusiness` = '39'
---
    public function countInventoryByBusinessID($businessID)
    {
        $query = $this->db->table('itemsinventory')
            ->selectSum('itemsinventory.inventory', 'totalInventory')
            ->join('itemswarehouse', 'itemsinventory.idItem = itemswarehouse.idItem')
            ->where('itemswarehouse.idBusiness', $businessID)
            ->get();

SELECT COUNT(*) AS `numrows`
FROM `invoices`
WHERE `idBusiness` = '39'
AND `Date` = '2024-08-30'
---
    public function countInvoicesToday($businessID)
    {
        $today = date('Y-m-d');

        $query = $this->db->table('invoices')
            ->where('idBusiness', $businessID)
            ->where('Date', $today)
            ->countAllResults();

SELECT SUM(`Value`) AS `Value`
FROM `invoices`
WHERE `idBusiness` = '39'
AND `Date` = '2024-08-30'
---
    public function sumInvoiceValuesToday($businessID)
    {
        $today = date('Y-m-d');

        $query = $this->db->table('invoices')
            ->selectSum('Value')
            ->where('idBusiness', $businessID)
            ->where('isSummaryInvoice', 0)
            ->where('Date', $today)
            ->get();

        $result = $query->getRow();