app/Models/itemsModel.php

    public function countItemsByBusinessID($businessID)
    {
        return $this->db->table('itemswarehouse')->where('idBusiness', $businessID)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `itemswarehouse`
WHERE `idBusiness` = '39'

    public function getExpiringItems($businessID)
    {
        $builder = $this->db->table('itemswarehouse iw');
        $builder->select('iw.Name, iw.Code, ie.expiryDate');
        $builder->join('itemsinventory ii', 'iw.idItem = ii.idItem', 'inner');
        $builder->join('itemsexpiry ie', 'ii.idInventory = ie.idInventory', 'inner');
        $builder->where('iw.idBusiness', $businessID);
        $builder->where('ie.expiryDate BETWEEN CURDATE() AND DATE_ADD(CURDATE(), INTERVAL 1 MONTH)');
        $builder->orderBy('ie.expiryDate', 'ASC');

        $result = $builder->get()->getResult();
---
SELECT `iw`.`Name`, `iw`.`Code`, `ie`.`expiryDate`
FROM `itemswarehouse` `iw`
INNER JOIN `itemsinventory` `ii` ON `iw`.`idItem` = `ii`.`idItem`
INNER JOIN `itemsexpiry` `ie` ON `ii`.`idInventory` = `ie`.`idInventory`
WHERE `iw`.`idBusiness` = '39'
AND `ie`.`expiryDate` BETWEEN CURDATE() AND DATE_ADD(CURDATE(), INTERVAL 1 MONTH)
ORDER BY `ie`.`expiryDate` ASC