app/Models/LabReportAttributesModel.php

SELECT *
FROM `lab_report_attributes`
WHERE `labTestID` = '17'
---
    public function getAttributesByTestId($labTestID)
    {
        return $this->where('labTestID', $labTestID)->findAll();