app/Models/LoginModel.php

SELECT SUM(`fee`) AS `totalRevenue`
FROM `labtest`
WHERE `businessId` = '39'
---
    public function getTotalTestRevenue($businessID)
    {
        $query = $this->db->table('labtest')
            ->selectSum('fee', 'totalRevenue')
            ->where('businessId', $businessID)
            ->get();