app/Models/LoginModel.php

SELECT *
FROM `users`
WHERE `businessID` = '39'
ORDER BY `ID` DESC
---
    public function getuserprofile()
    {
        $session = \Config\Services::session();
        $businessID = $session->get('businessID');

        return $this->db->table('users')
            ->where('businessID', $businessID)
            ->orderBy('ID', 'DESC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `labtestdetails`
JOIN `labtest` ON `labtestdetails`.`labTestID` = `labtest`.`test_id`
WHERE `labtest`.`businessId` = '39'
---
    public function getTotalTests($businessID)
    {
        $query = $this->db->table('labtestdetails')
            ->join('labtest', 'labtestdetails.labTestID = labtest.test_id')
            ->where('labtest.businessId', $businessID)
            ->countAllResults();

SELECT SUM(`Value`) AS `totalRevenue`
FROM `invoices`
WHERE `idBusiness` = '39'
---
    public function getTotalServiceRevenue($businessID)
    {
        $query = $this->db->table('invoices')
            ->selectSum('Value', 'totalRevenue')
            ->where('idBusiness', $businessID)
            ->where('isSummaryInvoice', 0)
            ->get();

        $result = $query->getRow();

SELECT SUM(`amount`) AS `TotalExpenditure`
FROM `expenses`
---
    public function getTotalExpenditure()
    {
        $query = $this->db->table('expenses')
            ->selectSum('amount', 'TotalExpenditure')
            ->get();

SELECT SUM(`amount`) AS `TotalExpenditure`
FROM `expenses`
WHERE MONTH(expense_date) = '08'
AND YEAR(expense_date) = '2024'
---
    public function getMonthlyExpenditure()
    {
        $query = $this->db->table('expenses')
            ->selectSum('amount', 'TotalExpenditure')
            ->where('MONTH(expense_date)', date('m'))
            ->where('YEAR(expense_date)', date('Y'))
            ->get();