app/Models/PurchaseModel.php

SELECT `itemswarehouse`.*, `taxtype`.`value` as `tax_value`, `taxtype`.`tax_id` as `idTVSH`
FROM `itemswarehouse`
LEFT JOIN `taxtype` ON `itemswarehouse`.`idTAX` = `taxtype`.`tax_id`
WHERE `itemswarehouse`.`status` = 'Active'
---
    public function getitems()
    {
        $builder = $this->db->table('itemswarehouse')
            ->select('itemswarehouse.*, taxtype.value as tax_value, taxtype.tax_id as idTVSH')
            ->join('taxtype', 'itemswarehouse.idTAX = taxtype.tax_id', 'left')
            ->where('itemswarehouse.status', 'Active');

        // if ($enableService != 1) {
        //     $builder->where('artmenu.isService', 0);
        // }
        return $builder->get()->getResultArray();

SELECT `idItem`
FROM `ratio`
WHERE `idItem` = '6642'
AND `idBusiness` = '39'
SELECT `idInventory`
FROM `itemsinventory`
WHERE `idItem` IN ('6642')
SELECT `expiryDate`
FROM `itemsexpiry`
WHERE `idInventory` IN ('6660')
---
    public function getServiceExpiry($serviceId, $businessID)
    {
        $db = \Config\Database::connect();
        $ratioQuery = $db->table('ratio')
            ->select('idItem')
            ->where('idItem', $serviceId)
            ->where('idBusiness', $businessID)
            ->get();
        $ratioResult = $ratioQuery->getResultArray();
        if (empty($ratioResult)) {
            return [];
        }
        $idItem = array_column($ratioResult, 'idItem');
        $inventoryQuery = $db->table('itemsinventory')
            ->select('idInventory')
            ->whereIn('idItem', $idItem)
            ->get();
        $inventoryResult = $inventoryQuery->getResultArray();
        if (empty($inventoryResult)) {
            return [];
        }
        $idInventory = array_column($inventoryResult, 'idInventory');
        $expiryQuery = $db->table('itemsexpiry')
            ->select('expiryDate')
            ->whereIn('idInventory', $idInventory)
            ->get();

SELECT *
FROM `supplier`
WHERE `status` = 'Active'
AND `idBusiness` = '39'
---
    public function getSupplierNames()
    {
        $businessId = session()->get('businessID');
        return $this->db->table('supplier')
            ->select('*')
            ->where('status', 'Active')
            ->where('idBusiness', $businessId)
            ->get()
            ->getResult();