app/Models/purchaseInvoiceModel.php

    public function insertPurchaseInvoice($data)
    {
        return $this->insert($data);
---
INSERT INTO `purchase_invoices` (`idSupplier`, `Value`, `actual_Value`, `idUser`, `Status`, `idBusiness`, `idCancellation`, `invOrdNum`, `idWarehouse`, `FIC`, `ValueTVSH`, `idCurrency`, `rate`, `paymentMethod`, `isImport`, `idPoint_of_sale`, `transporterId`, `invoiceType`, `Contract`, `invoice_period_start_date`, `invoice_period_end_date`, `InvoiceNotes`) VALUES ('2', '100', 100, '25', 'open', '39', 0, 1, 1, 0, '9.090909090909092', '1', '1.0', '1', 0, 0, 0, 0, 0, 0, 0, '')

    public function getLastInvoiceNumber()
    {
        $result = $this->select('invOrdNum')
            ->orderBy('idReceipts', 'DESC')
            ->first();
---
SELECT `invOrdNum`
FROM `purchase_invoices`
ORDER BY `idReceipts` DESC
 LIMIT 1

    public function getPurchaseInvoiceNumber($businessID, $idPayment)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idReceipts', $idPayment)
            ->select('invOrdNum')
            ->get()
            ->getRowArray()['invOrdNum'] ?? null;
---
SELECT `invOrdNum`
FROM `purchase_invoices`
WHERE `idBusiness` = '39'
AND `idReceipts` = 44

    public function getInvoice()
    {
        return $this->db->table('purchase_invoices')
            ->select('idReceipts, invOrdNum')
            ->get()
            ->getResultArray();
---
SELECT `idReceipts`, `invOrdNum`
FROM `purchase_invoices`