app/Models/salesModel.php

SELECT `idTables`, `name`
FROM `tables`
---
    public function getTableName()
    {
        return $this->db->table('tables')
            ->select('idTables, name')
            ->get()
            ->getResultArray();

SELECT `artmenu`.*, `taxtype`.`value` as `tax_value`, `taxtype`.`tax_id` as `idTVSH`
FROM `artmenu`
LEFT JOIN `taxtype` ON `artmenu`.`idTVSH` = `taxtype`.`tax_id`
WHERE `artmenu`.`status` = 'Active'
---
    public function getServices2($enableService)
    {
        $builder = $this->db->table('artmenu')
            ->select('artmenu.*, taxtype.value as tax_value, taxtype.tax_id as idTVSH')
            ->join('taxtype', 'artmenu.idTVSH = taxtype.tax_id', 'left')
            ->where('artmenu.status', 'Active');

        if ($enableService != 1) {
            $builder->where('artmenu.isService', 0);
        }
        return $builder->get()->getResultArray();

SELECT `idCatArt`, `name`, `idSector`
FROM `catart`
---
    public function getCategories()
    {
        return $this->db->table('catart')
            ->select('idCatArt, name, idSector')
            ->get()
            ->getResultArray();