app/Models/salesModel.php

    public function getpayment()
    {
        return $this->db->table('paymentmethods')
            ->select('idPaymentMethods, Method')
            ->get()
            ->getResultArray();
---
SELECT `idPaymentMethods`, `Method`
FROM `paymentmethods`

    public function getCurrancy()
    {
        return $this->db->table('currency')
            ->select('id, Currency')
            ->get()
            ->getResultArray();
---
SELECT `id`, `Currency`
FROM `currency`

    public function getServices()
    {
        return $this->db->table('artmenu')
            ->select('idArtMenu, Name, Price, idCatArt')
            ->where('status', 'Active')
            ->get()
            ->getResultArray();
---
SELECT `idArtMenu`, `Name`, `Price`, `idCatArt`
FROM `artmenu`
WHERE `status` = 'Active'

    public function getCategories()
    {
        return $this->db->table('catart')
            ->select('idCatArt, name, idSector')
            ->get()
            ->getResultArray();
---
SELECT `idCatArt`, `name`, `idSector`
FROM `catart`

    public function getSales()
    {

        return $this->db->table('invoices')
            ->join('client', 'client.idClient = invoices.idClient')
            ->join('currency', 'currency.id = invoices.idCurrency')
            ->join('paymentmethods', 'paymentmethods.idPaymentMethods = invoices.paymentMethod')
            ->select('invoices.*, client.client as clientName, currency.Currency, paymentmethods.Method as PaymentMethod')
            ->orderBy('invoices.invOrdNum', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `invoices`.*, `client`.`client` as `clientName`, `currency`.`Currency`, `paymentmethods`.`Method` as `PaymentMethod`
FROM `invoices`
JOIN `client` ON `client`.`idClient` = `invoices`.`idClient`
JOIN `currency` ON `currency`.`id` = `invoices`.`idCurrency`
JOIN `paymentmethods` ON `paymentmethods`.`idPaymentMethods` = `invoices`.`paymentMethod`
ORDER BY `invoices`.`invOrdNum` DESC

    public function getSalesDetails($idReceipts)
    {
        return $this->db->table('invoicedetail')
            ->join('artmenu', 'artmenu.idArtMenu = invoicedetail.idArtMenu')
            ->join('invoices', 'invoices.idReceipts = invoicedetail.idReceipts')
            ->join('client', 'client.idClient = invoices.idClient')
            ->join('paymentmethods', 'paymentmethods.idPaymentMethods = invoices.paymentMethod', 'left') // Join with paymentmethods table
            ->join('currency', 'currency.id = invoices.idCurrency', 'left')
            ->where('invoicedetail.idReceipts', $idReceipts)
            ->select('invoicedetail.*, artmenu.idUnit as Unit,artmenu.Name as ServiceTypeName,artmenu.Code as Code,invoices.Notes, invoices.invOrdNum, invoices.Status, invoices.Value, invoices.invoice_period_end_date as due, invoices.Date as InvoiceDate, invoices.Time as InvoiceTime, client.*, paymentmethods.Method as PaymentMethod, currency.Currency as Currency')
            ->get()
            ->getResultArray();
---
SELECT `invoicedetail`.*, `artmenu`.`idUnit` as `Unit`, `artmenu`.`Name` as `ServiceTypeName`, `artmenu`.`Code` as `Code`, `invoices`.`Notes`, `invoices`.`invOrdNum`, `invoices`.`Status`, `invoices`.`Value`, `invoices`.`invoice_period_end_date` as `due`, `invoices`.`Date` as `InvoiceDate`, `invoices`.`Time` as `InvoiceTime`, `client`.*, `paymentmethods`.`Method` as `PaymentMethod`, `currency`.`Currency` as `Currency`
FROM `invoicedetail`
JOIN `artmenu` ON `artmenu`.`idArtMenu` = `invoicedetail`.`idArtMenu`
JOIN `invoices` ON `invoices`.`idReceipts` = `invoicedetail`.`idReceipts`
JOIN `client` ON `client`.`idClient` = `invoices`.`idClient`
LEFT JOIN `paymentmethods` ON `paymentmethods`.`idPaymentMethods` = `invoices`.`paymentMethod`
LEFT JOIN `currency` ON `currency`.`id` = `invoices`.`idCurrency`
WHERE `invoicedetail`.`idReceipts` = '587'

    public function getPaymentDetails($idReceipts)
    {
        return $this->db->table('invoicepayment')
            ->join('invoicepaymentdetails', 'invoicepaymentdetails.idPayment = invoicepayment.idPayment')
            ->join('paymentmethods', 'paymentmethods.idPaymentMethods = invoicepaymentdetails.method', 'left')
            ->join('currency', 'currency.id = invoicepaymentdetails.idPaymentMethod', 'left')
            ->where('invoicepayment.idReceipt', $idReceipts)
            ->select('invoicepaymentdetails.*, paymentmethods.Method as PaymentMethodName, currency.Currency as Currency')
            ->get()
            ->getResultArray();
---
SELECT `invoicepaymentdetails`.*, `paymentmethods`.`Method` as `PaymentMethodName`, `currency`.`Currency` as `Currency`
FROM `invoicepayment`
JOIN `invoicepaymentdetails` ON `invoicepaymentdetails`.`idPayment` = `invoicepayment`.`idPayment`
LEFT JOIN `paymentmethods` ON `paymentmethods`.`idPaymentMethods` = `invoicepaymentdetails`.`method`
LEFT JOIN `currency` ON `currency`.`id` = `invoicepaymentdetails`.`idPaymentMethod`
WHERE `invoicepayment`.`idReceipt` = '587'

    public function getServiceExpiry($serviceId, $businessID)
    {
        $db = \Config\Database::connect();
        $ratioQuery = $db->table('ratio')
            ->select('idItem')
            ->where('idArtMenu', $serviceId)
            ->where('idBusiness', $businessID)
            ->get();
        $ratioResult = $ratioQuery->getResultArray();
        if (empty($ratioResult)) {
            return [];
        }
        $idItem = array_column($ratioResult, 'idItem');
        $inventoryQuery = $db->table('itemsinventory')
            ->select('idInventory')
            ->whereIn('idItem', $idItem)
            ->get();
        $inventoryResult = $inventoryQuery->getResultArray();
        if (empty($inventoryResult)) {
            return [];
        }
        $idInventory = array_column($inventoryResult, 'idInventory');
        $expiryQuery = $db->table('itemsexpiry')
            ->select('expiryDate')
            ->whereIn('idInventory', $idInventory)
            ->get();
        return $expiryQuery->getResultArray();
---
SELECT `idItem`
FROM `ratio`
WHERE `idArtMenu` = '1483'
AND `idBusiness` = '39'
SELECT `idInventory`
FROM `itemsinventory`
WHERE `idItem` IN ('6557')
SELECT `expiryDate`
FROM `itemsexpiry`
WHERE `idInventory` IN ('6576')

    public function getInvoiceByOrdNum($invOrdNum)
    {
        $session = \Config\Services::session();
        $businessID = $session->get('businessID');
        $invoice = $this->db->table('invoices')
            ->where('invOrdNum', $invOrdNum)
            ->where('idBusiness', $businessID)
            ->get()
            ->getRow();

        if ($invoice) {
            $payments = $this->db->table('invoicepaymentdetails')
                ->selectSum('invoicepaymentdetails.value', 'totalPaid')
                ->join('invoicepayment', 'invoicepayment.idPayment = invoicepaymentdetails.idPayment')
                ->where('invoicepayment.idReceipt', $invoice->idReceipts)
                ->get()
                ->getRow();

            $totalPaid = $payments->totalPaid ?? 0;
            $invoice->remainingValue = $invoice->Value - $totalPaid;
---
SELECT SUM(`invoicepaymentdetails`.`value`) AS `totalPaid`
FROM `invoicepaymentdetails`
JOIN `invoicepayment` ON `invoicepayment`.`idPayment` = `invoicepaymentdetails`.`idPayment`
WHERE `invoicepayment`.`idReceipt` = '587'