app/Models/ServicesModel.php

SELECT *
FROM `itemswarehouse`
WHERE `status` = 'active'
AND `idBusiness` = '39'
---
    public function getActiveItems()
    {
        $businessID = session()->get('businessID');
        $builder = $this->db->table('itemswarehouse');
        return $builder->select('*')
            ->where('status', 'active')
            ->where('idBusiness', $businessID)
            ->get()
            ->getResultArray();