app/Models/ServicesModel.php

    public function getUnits()
    {
        return $this->db->table('units')
            ->select('idUnit, name')
            ->get()
            ->getResultArray();
---
SELECT `idUnit`, `name`
FROM `units`

    public function getCategories()
    {
        return $this->db->table('catart')
            ->select('idCatArt, name')
            ->get()
            ->getResultArray();
---
SELECT `idCatArt`, `name`
FROM `catart`

    public function getTaxes()
    {
        return $this->db->table('taxtype')
            ->select('tax_id, value')
            ->get()
            ->getResultArray();
---
SELECT `tax_id`, `value`
FROM `taxtype`

    public function getServices($perPage = 20, $currentPage = 1)
    {
        $businessID = session()->get('businessID');

        $offset = ($currentPage - 1) * $perPage;

        $builder = $this->db->table('artmenu');
        return $builder->join('units', 'units.idUnit = artmenu.idUnit')
            ->select('artmenu.*, units.name')
            ->where('artmenu.idBusiness', $businessID)
            ->orderBy('artmenu.idArtMenu', 'DESC')
            ->limit($perPage, $offset)
            ->get()
            ->getResultArray();
---
SELECT `artmenu`.*, `units`.`name`
FROM `artmenu`
JOIN `units` ON `units`.`idUnit` = `artmenu`.`idUnit`
WHERE `artmenu`.`idBusiness` = '39'
ORDER BY `artmenu`.`idArtMenu` DESC
 LIMIT 20

    public function getServicesCount()
    {
        $businessID = session()->get('businessID');

        $builder = $this->db->table('artmenu');
        $builder->where('artmenu.idBusiness', $businessID);
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `artmenu`
WHERE `artmenu`.`idBusiness` = '39'

    public function getActiveItems()
    {
        $businessID = session()->get('businessID');
        $builder = $this->db->table('itemswarehouse');
        return $builder->select('*')
            ->where('status', 'active')
            ->where('idBusiness', $businessID)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `itemswarehouse`
WHERE `status` = 'active'
AND `idBusiness` = '39'

    public function getRatio()
    {
        $businessID = session()->get('businessID');
        $builder = $this->db->table('ratio');
        return $builder->select('*')
            ->where('idBusiness', $businessID)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `ratio`
WHERE `idBusiness` = '39'

    public function insertBatch(?array $data = null, ?bool $escape = null, int $batchSize = 100, bool $testing = false)
    {
        $builder = $this->db->table('artmenu');

        // Perform batch insertion
        $builder->insertBatch($data, $escape, $batchSize);
---
INSERT INTO `artmenu` (`Barcode`, `Characteristic1`, `Characteristic2`, `Code`, `Cost`, `Image`, `Name`, `Notes`, `Price`, `Product_mix`, `Promotional_Price`, `idBusiness`, `idCatArt`, `idPoint_of_sale`, `idTVSH`, `idUnit`, `isService`, `noTvshType`, `status`)
VALUES ('323','','','3232','300.00','defaults/download.png','TEST ITEM','',0,'0',0,'39','21',1,0,'6',0,0,'Active')

    public function insertBatchRatio(?array $data = null, ?bool $escape = null, int $batchSize = 100, bool $testing = false)
    {
        $builder = $this->db->table('ratio');
        return $builder->insertBatch($data, $escape, $batchSize);
---
INSERT INTO `ratio` (`idArtMenu`, `idBusiness`, `idItem`, `ratio`)
VALUES (780,'39','2415',1)