app/Models/SupplierModel.php

    public function getsupplierContact($businessID, $id)
    {
        return $this->db->table($this->table)
            ->where('idBusiness', $businessID)
            ->where('idSupplier', $id)
            ->select('contact')
            ->get()
            ->getRowArray()['contact'] ?? null;
---
SELECT `contact`
FROM `supplier`
WHERE `idBusiness` = '39'
AND `idSupplier` = '2'