app/Models/TestModel.php

    public function TestReports()
    {
        return $this->db->table('labtest')
            ->join('client', 'client.idClient = labtest.clientId')
            ->join('users', 'users.ID = labtest.userId')
            ->select('labtest.*, client.client as clientName, users.fName as userName')
            ->get()
            ->getResultArray();
---
SELECT `labtest`.*, `client`.`client` as `clientName`, `users`.`fName` as `userName`
FROM `labtest`
JOIN `client` ON `client`.`idClient` = `labtest`.`clientId`
JOIN `users` ON `users`.`ID` = `labtest`.`userId`
WHERE `client`.`client` = 'Majid Khan'